In [2]:
#Integrantes del grupo

# Flavia Morena Valentina Pacheco Jaime
# Jozek Andrzej Hajduk Sánchez
# Jorge Andres Rangel Zapata

In [3]:
import psycopg2
import pandas as pd

from google.cloud import bigquery
from google.oauth2 import service_account

In [4]:
conn = psycopg2.connect( host = 'localhost', port = 5432, database = 'Adventure', user = 'jorgedevops' )

In [5]:
cur = conn.cursor()
table1 = pd.read_sql_query( 'SELECT st.name , count(pp.businessentityid) FROM sales.salesterritory st, sales.salesorderheader so, person.person pp WHERE pp.businessentityid = so.customerid AND st.territoryid  = so.territoryid group by (st.name)', conn )
cur.close()

In [7]:
table1

             name  count
0          France   1552
1       Southwest   3140
2       Northwest   2379
3  United Kingdom   2041
4       Northeast      7
5         Central      5
6       Australia   4283
7         Germany   1567
8       Southeast     13
9          Canada   2476

In [8]:
cur = conn.cursor()
table2 = pd.read_sql_query( 'SELECT  pp.name, count(ps.productsubcategoryid) FROM production.product pp, production.productsubcategory ps group by (pp.name)', conn )
cur.close()

In [9]:
table2

                            name  count
0                    LL Road Rim     37
1         Mountain-100 Black, 38     37
2      HL Road Frame - Black, 52     37
3                  Flat Washer 6     37
4                      Hex Nut 7     37
..                           ...    ...
499      HL Road Frame - Red, 48     37
500        Road-350-W Yellow, 40     37
501  LL Touring Frame - Blue, 58     37
502       Men's Sports Shorts, M     37
503      Mountain-100 Silver, 38     37

[504 rows x 2 columns]